[{
    "student": {
        "mainText": {
            "header": "Secure Your Tech Internship",
            "description": "Step into the world of tech internships with ease. Our platform connects you with industry engineers ready to refer you, skyrocketing your chances to land that dream internship!"
        },
        "features": [
            {
                "title": "Personalized Referrals",
                "icon": "feature1-icon-student.png",
                "description": "Get referred by experienced engineers, tailored to your skills and interests, giving you an advantage in the competitive internship market."
            },
            {
                "title": "Insider Industry Insights",
                "icon": "feature2-icon-student.png",
                "description": "Gain exclusive insights into the tech industry from engineers. Learn what companies are looking for in interns and how to stand out."
            },
            {
                "title": "Build Your Professional Network",
                "icon": "feature3-icon-student.png",
                "description": "Expand your professional network by connecting with tech experts, opening doors to future opportunities and industry knowledge."
            }
        ],
        "waitlistModalText": "<b>Join our waitlist for exclusive benefits!</b><br>Early sign-ups get 10 complimentary referral requests to jumpstart your internship journey."
    },
    "engineer": {
        "mainText": {
            "header": "Discover Top Tech Talent",
            "description": "Leverage your experience to guide aspiring tech interns. Your referrals can shape careers and bring fresh talent to your team."
        },
        "features": [
            {
                "title": "Mentor Future Tech Stars",
                "icon": "feature1-icon-engineer.png",
                "description": "Play a pivotal role in a student's career by offering referrals and mentorship, and witness their growth in the tech world."
            },
            {
                "title": "Targeted Job Referrals",
                "icon": "feature2-icon-engineer.png",
                "description": "Directly refer candidates for specific job postings at your company, matching interns with the perfect roles to suit their skills."
            },
            {
                "title": "Expand Your Professional Impact",
                "icon": "feature3-icon-engineer.png",
                "description": "Strengthen your professional network and industry reputation by connecting with and supporting emerging tech talent."
            }
        ],
        "waitlistModalText": "<b>Engineers, sign up early!</b><br>Be one of the first referrers and get featured on our platform, enhancing your impact in the tech community."
    }
}]